/**
 * 12.创建一个文本文件，内含20行，每行30个整数。这些整数都在0～9 之间，
 * 用空格分开。该文件是用数字表示一张图片，0～9表示逐渐增加的灰度。
 * 编写一个程序，把文件中的内容读入一个20×30的int数组中。
 * 一种把这些数字转换为图片的粗略方法是：该程序使用数组中的值初始化一个
 * 20×31 的字符数组，用值0对应空格字符，1对应点字符，以此类推。
 * 数字越大表示字符所占的空间越大。例如，用#表示9。
 * 每行的最后一个字符（第31个） 是空字符，这样该数组包含了20个字符串。
 * 最后，程序显示最终的图片 （即，打印所有的字符串），并将结果储存在文本文件中。
 * 例如，下面是开始的数据：
 * 009000000000589985200000000000
 * 000090000000589985520000000000
 * 000000000000581985452000000000
 * 000090000000589985045200000000
 * 009000000000589985004520000000
 * 000000000000589185000452000000
 * 000000000000589985000045200000
 * 555555555555589985555555555555
 * 888888888888589985888888888888
 * 999909999999999999999939999999
 * 888888888888589985888888888888
 * 555555555555589985555555555555
 * 000000000000589985000000000000
 * 000000000000589985000066000000
 * 000022000000589985005600650000
 * 000033000000589985056111165000
 * 000044000000589985005600650000
 * 000055000000589985000066000000
 * 000000000000589985000000000000
 * 000000000000589985000000000000
 * 根据以上描述选择特定的输出字符，最终输出如下：
#   *%##%*'
  # *%##%**'
    *%.#%*~*'
  # *%##%* ~*'
#   *%##%* ~*'
    *%#.%*  ~*'
    *%##%*   ~*'
*************%##%*************
%%%%%%%%%%%%*%##%*%%%%%%%%%%%%
#### #################:#######
%%%%%%%%%%%%*%##%*%%%%%%%%%%%%
*************%##%*************
    *%##%*
    *%##%* ==
 '' *%##%* *= =*
 :: *%##%* *=....=*
 ~~ *%##%* *= =*
 ** *%##%* ==
    *%##%*
    *%##%*
 */
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#define ROWS 20
#define COLS 30
int get_num(char ch);
char get_char(int i);

int main(void)
{
  FILE *fp1, *fp2;
  char * numberfile = "numbers";
  char * picfile = "pic";
  int numbers[ROWS][COLS];
  char chars[ROWS][COLS + 1];
  char temp[COLS + 2];
  int i, j;
  if ((fp1 = fopen(numberfile, "r")) == NULL)
  {
    fprintf(stderr, "Could not open %s.\n", numberfile);
    exit(EXIT_FAILURE);
  }
  if ((fp2 = fopen(picfile, "w")) == NULL)
  {
    fprintf(stderr, "Could not open %s.\n", picfile);
    exit(EXIT_FAILURE);
  }
  for (i = 0; i < ROWS; i++)
  {
    fgets(temp, COLS + 2, fp1);
    for (j = 0; j < COLS; j++)
    {
      numbers[i][j] = get_num(temp[j]);
    }
  }
  for (i = 0; i < ROWS; i++)
  {
    for (j = 0; j < COLS; j++)
    {
      chars[i][j] = get_char(numbers[i][j]);
    }
    chars[i][COLS] = '\0';
    fputs(chars[i], fp2);
    fputs("\n", fp2);
  }
  fclose(fp1);
  fclose(fp2);
  return 0;
}

int get_num(char ch)
{
  char temp[2];
  sprintf(temp, "%c", ch);
  return atoi(temp);
}

char get_char(int i)
{
  return ' ' + i;
}
